#+STARTUP: folded indent inlineimages
#+PROPERTY: header-args:R :results output :exports both :colnames yes
#+PROPERTY: header-args:R+ :session *R:blog*  :width 640 :height 480 :eval never-export
#+OPTIONS: author:nil H:6 toc:nil
#+HUGO_BASE_DIR: ~/Dropbox/repos/github/five-dots/blog
#+HUGO_SECTION: post/2019/11/

#+TITLE: [R と Stan で株式時系列分析シリーズ] 株価を入手する
#+DATE: 2019-11-18
#+HUGO_CATEGORIES: finance
#+HUGO_TAGS: r etf stock
#+HUGO_CUSTOM_FRONT_MATTER: :toc false


** Yahoo Finance からダウンロード

={tidyquant}= を利用して [[https://finance.yahoo.com/][Yahoo Finance]] からデータを取得する。 ={tidyquant}= は Tidy な =data.frame= として株価をダウンロードしてくれるので便利だ。

R から Yahoo Finance のデータを読み込む際には、一般的に、[[https://github.com/joshuaulrich/quantmod][ ={quantmod}= ]]が利用されることが多いようだ。しかし ={quantmod}= では、 =xts= でデータが取得されるため ={tidyverse}= のパッケージ群を利用することができない。個人的には、データは =data.frame= (=tibble含む=) に統一しておき ={dplyr}= や ={ggplot2}= などのパッケージの関数を扱えるようにしておいたほうが、快適にデータ分析を進められると思う。

ただし、一部の時系列分析用のパッケージなどでは、入力に =xts= を求めるものがあるので、その場合は都度変換して対処する方針だ。今回も ={PerformanceAnalytics}= を利用する際に =xts= に変換する処理が必要になる。

それでは、先程用意した ETF リストの銘柄の株価を全て取得してみよう。
#+begin_src R :results silent
rawdata <- tq_get(symbols$symbol, from = "1998-01-01")
#+end_src

データは、典型的な四本値 + 分割・配当調整済みの終値 (adjusted) という構成だ。
#+begin_src R :results value
head(rawdata) %>% mutate_if(is.numeric, round, digits = 2)
#+end_src

#+RESULTS:
| symbol |       date |  open |  high |   low | close | volume | adjusted |
|--------+------------+-------+-------+-------+-------+--------+----------|
| XLE    | 1998-12-22 | 23.31 | 23.39 | 23.19 | 23.27 |  15200 |    15.47 |
| XLE    | 1998-12-23 | 23.34 | 23.75 | 23.31 | 23.75 |  67800 |     15.8 |
| XLE    | 1998-12-24 | 23.81 | 23.81 | 23.59 | 23.62 |  12300 |    15.71 |
| XLE    | 1998-12-28 | 23.75 | 23.75 | 23.34 |  23.5 |  13500 |    15.63 |
| XLE    | 1998-12-29 | 23.56 | 23.73 | 23.34 | 23.73 |  22000 |    15.79 |
| XLE    | 1998-12-30 | 23.72 | 23.72 | 23.36 | 23.38 |  21800 |    15.55 |

** データの確認

データの前処理が完了したタイミングで、利用可能期間や =NA= の有無などを確認しておく。
#+begin_src R :results value :colnames yes :rownames yes
data %>%
  group_by(symbol, index) %>%
  summarize(start = min(date), end = max(date), na = sum(is.na(ret)))
#+end_src

#+RESULTS:
|    | symbol | index                         |      start |        end | na |
|----+--------+-------------------------------+------------+------------+----|
|  1 | DIA    | Dow 30                        | 1998-01-21 | 2019-11-12 |  0 |
|  2 | FXB    | GBP                           | 2006-06-27 | 2019-11-12 |  0 |
|  3 | FXE    | EUR                           | 2005-12-13 | 2019-11-12 |  0 |
|  4 | FXF    | CHF                           | 2006-06-27 | 2019-11-12 |  0 |
|  5 | FXY    | JPY                           | 2007-02-14 | 2019-11-12 |  0 |
|  6 | GLD    | Gold                          | 2004-11-19 | 2019-11-12 |  0 |
|  7 | HYG    | High Yield                    | 2007-04-12 | 2019-11-12 |  0 |
|  8 | IEF    | 7-10 Year                     | 2002-07-31 | 2019-11-12 |  0 |
|  9 | IJH    | S&P MidCap 400                | 2000-05-30 | 2019-11-12 |  0 |
| 10 | IJR    | S&P SmallCap 600              | 2000-05-30 | 2019-11-12 |  0 |
| 11 | IWB    | Russel 1000                   | 2000-05-22 | 2019-11-12 |  0 |
| 12 | IWM    | Russel 2000                   | 2000-05-30 | 2019-11-12 |  0 |
| 13 | IYR    | Dow Jones U.S. Real Estate    | 2000-06-20 | 2019-11-12 |  0 |
| 14 | LQD    | Investment Grade              | 2002-07-31 | 2019-11-12 |  0 |
| 15 | PFF    | Preffered Stock               | 2007-04-02 | 2019-11-12 |  0 |
| 16 | QQQ    | NASDAQ 100                    | 1999-03-11 | 2019-11-12 |  0 |
| 17 | SHV    | Short Term                    | 2007-01-12 | 2019-11-12 |  0 |
| 18 | SHY    | 1-3 Year                      | 2002-07-31 | 2019-11-12 |  0 |
| 19 | SLV    | Silver                        | 2006-05-01 | 2019-11-12 |  0 |
| 20 | SPY    | S&P 500                       | 1993-02-01 | 2019-11-12 |  0 |
| 21 | TIP    | Inflation Protected           | 2003-12-08 | 2019-11-12 |  0 |
| 22 | TLT    | 20+ Year                      | 2002-07-31 | 2019-11-12 |  0 |
| 23 | USO    | Crude Oil                     | 2006-04-11 | 2019-11-12 |  0 |
| 24 | UUP    | USD                           | 2007-03-02 | 2019-11-12 |  0 |
| 25 | VXX    | S&P 500 VIX Short-Term Future | 2009-02-02 | 2019-11-12 |  0 |
| 26 | XLB    | Materials                     | 1998-12-23 | 2019-11-12 |  0 |
| 27 | XLE    | Energy                        | 1998-12-23 | 2019-11-12 |  0 |
| 28 | XLF    | Financials                    | 1998-12-23 | 2019-11-12 |  0 |
| 29 | XLI    | Industrial                    | 1998-12-23 | 2019-11-12 |  0 |
| 30 | XLK    | Technology                    | 1998-12-23 | 2019-11-12 |  0 |
| 31 | XLP    | Consumer Staples              | 1998-12-23 | 2019-11-12 |  0 |
| 32 | XLU    | Utilities                     | 1998-12-23 | 2019-11-12 |  0 |
| 33 | XLV    | Health                        | 1998-12-23 | 2019-11-12 |  0 |
| 34 | XLY    | Consumer Discretionary        | 1998-12-23 | 2019-11-12 |  0 |

